[
    {
        "name": "Буковина",
        "code": "Bukovyna",
        "description": "Буковинська вишиванка відрізняється яскравими кольорами і сміливим поєднанням барв, що робить її однією з найпопулярніших і найважчих в Україні. Орнаменти включають геометричні мотиви і рослинні елементи. Тканини традиційно фарбували природними барвниками, використовуючи конопляні та лляні нитки. Особливими є техніки вишивки на рукавах (прямий, скісний, шаховий орнаменти) та оздоблення металізованими нитками. Буковинські сорочки вирізняються різноманітністю стилів, відображаючи впливи румунської та бесарабської культур."
    },
    {
        "name": "Донеччина",
        "code": "Donetsk region",
        "description": "Донецька вишиванка вирізняється використанням теплих кольорів, зокрема червоного в поєднанні із сірими елементами, а чорний колір застосовується переважно для траурних випадків. Орнаменти включають квіти, рослини, дерева та птахів, які символізують чарівність, а також міфічні символи, такі як сонце, місяць і зорі. Техніки вишивки є всі, хіба що окрім яворівки та низинки. Святкові та повсякденні вишиванки відрізняються складністю та кольоровою гамою узорів. Рушники розрізняються за призначенням – для вікон, ікон, весіль, колискові та побутові, з різними орнаментами та без вишивки для повсякденного використання."
    },
    {
        "name": "Галичина",
        "code": "Galychyna",
        "description": "Галицька вишиванка відома своєю багатою традицією. Найпопулярнішими орнаментами були рослинні та геометричні візерунки, які зазвичай заповнювали всю основу тканини. Кольорова гама включала переважно червоний, жовтий та зелений кольори, з часто використовуваним поєднанням кількох відтінків жовтого, що надавало вишиванкам золотистого блиску. Вишивали здебільшого вовняними нитками, фарбованими натуральними барвниками, такими як бузина, горіх, вільха та буряковий сік. Серед популярних технік вишивки були яворівка, стебнівка, лічильна гладь, борщівка та низинка. З часом до цих технік додалася ще одна – хрестик, який також здобув значну популярність."
    },
    {
        "name": "Наддніпрянщина",
        "code": "Naddniprianshchyna",
        "description": "Наддніпрянська вишиванка відзначається своєю багатогранністю та багатством орнаментів, об'єднуючи традиції багатьох областей. Вишивки лівобережної частини характеризуються білим кольором з відтінками сірого або синього, технікою настилування з ажурним вирізанням та орнаментами виноградних грон і хмелю. Правобережні вишивки поєднують синій та чорний кольори, використовують мережку, набирування та вирізування, а також орнаменти з трояндами. Київщина славиться поєднанням геометричних та рослинних орнаментів, з використанням білих, червоних та синіх ниток. Полтавщина відома ніжними білими вишивками з пастельними відтінками, а Чернігівщина – \"білими вишивками\" з геометрично-рослинними візерунками. Кожен регіон вносить свої особливості, зберігаючи культурну спадщину та самобутність Наддніпрянщини."
    },
    {
        "name": "Поділля",
        "code": "Podillya",
        "description": "Подільська вишиванка вважається однією з найскладніших та найгарніших в Україні, відрізняючись високохудожньою технікою виконання та багатством орнаментів. Вишивали переважно на конопляному та лляному полотні, використовуючи лляні, вовняні, бавовняні, металеві та шовкові нитки, а також бісер. Домінують кольори стиглого жита, чорний, темно-вишневий, червоно-чорний, синій та зелений. Популярною є вишивка \"білим по білому\" з техніками \"солов'їні вічка\", \"зерновий вивід\", \"довбанка\". Орнаменти включають рослинні мотиви (\"реп'яхи\", \"соняшник\", \"чорнобривці\"), тваринні зображення (\"сови\", \"голуби\", \"вужі\") та побутові елементи (\"гребінці\", \"човни\"). Серед технік – поперечна та поздовжня \"низь\", \"двобічний шов\" (штапівка), \"переплетені мережки\", \"гладь\" та \"шабак\". Вишивка різниться за регіонами Поділля, від темних кольорів Західного Поділля до яскравих квіткових орнаментів Тернопільщини, зберігаючи багатство символіки та витонченість візерунків."
    },
    {
        "name": "Полісся",
        "code": "Polissya",
        "description": "Поліська вишиванка вирізняється простотою, вишуканістю та чіткістю композиції, з акцентом на геометричні орнаменти і використанням червоних ниток для додання яскравості. Основними тканинами були біло-сірі льняні або конопляні домоткані полотна. Техніки вишивки включають «занизування», гладь, «набирування» та «вирізування». Орнаменти часто включають ромби, восьмикутні зірки, рослинні мотиви (виноград, терен, барвінок) та пташок. Жіночі сорочки мали стоячий або викладчатий комір, зібрані на нитку рукави, довжину до середини литки та вишивку на поличках, рукавах і подолі. Чоловічі сорочки були довгими, з вишивкою на комірі, чохлах і подолі, часто мали по боках вшиті клини. Пізніше додалася техніка хрестика, що привнесла нові рослинні мотиви."
    },
    {
        "name": "Причорномор'я",
        "code": "Prychornomoria",
        "description": "Вишиванки Причорномор'я відзначаються впливом молдавської та румунської культур, використовують геометричні та рослинні орнаменти у червоних, чорних, жовтих і синіх тонах. Особливістю крою є рукави з пухликами, зібраними складками нижче плечового шва. Вишиванки Причорномор'я мають простіші орнаменти з окремими квіточками і гілочками барвінку, вільні рукави без зборок та чотирикутний виріз довкола шиї. В регіоні популярними є сильно стилізовані рослинні мотиви та поєднання синього і жовтого кольорів, що символізують небо і пісок, море і сонце."
    },
    {
        "name": "Слобожанщина",
        "code": "Slobozhanshchina",
        "description": "Слобожанська вишиванка вирізняється своєю унікальністю та багатством орнаментів, що збереглися до сьогодні. Основними характеристиками є техніка \"білим по білому\", палеві відтінки кольорів без контрастних чорного та червоного, а також рослинні та рослинно-геометричні орнаменти. Характерними для Слобожанщини є також мережка та ажурні техніки, які додають вишиванкам елегантності. Орнаменти часто містять символи родючості, свободи та захисні знаки, такі як свастика, яка в давнину символізувала світло і захист. Жіночі сорочки мали високі стоячі коміри та червоні стрічки, а чоловічі сорочки відзначалися варіативністю моделей. Вишивали здебільшого лляними нитками, використовували техніку вибивання по тканині. Слобожанська вишиванка відображає складний історичний шлях регіону та багаті культурні впливи, зберігаючи свою самобутність і неповторність."
    },
    {
        "name": "Таврія",
        "code": "Tavria",
        "description": "Вишиванки Таврії відзначаються синтезом багатокультурних традицій, зокрема впливами Київщини, Полтавщини та Криму. Вишиванки Таврії часто виконуються в техніках \"білим по білому\" та з використанням пастельних кольорів, а також червоних та чорних ниток для створення геометричних і рослинних орнаментів. Характерними є мотиви \"дерева життя\", дзеркально-симетричні гілки, квіти, пуп'янки, листя, маки, волошки та польові квіти. Також тут зберігаються складні техніки кримськотатарської вишивки, такі як \"татар ішлеме\" і \"теллі\", з використанням ніжних кольорів, наприклад, рожевого, зеленого, блакитного та жовтого. Основні мотиви включають рослинні орнаменти, зображення \"дерева життя\", геометричні фігури, а також символи, що несуть сакральний зміст, як-от трикутники та образи птахів."
    },
    {
        "name": "Волинь",
        "code": "Volynska",
        "description": "Волинська вишиванка вирізняється своєю стриманістю та лаконічністю, з використанням переважно геометричних орнаментів, таких як зірки, ромби, ламані лінії. Особливістю є техніка занизування, яка імітує човникове ткацтво, створюючи щільні та витончені композиції. Колористика здебільшого включає червоний колір, також використовуються сині та чорні нитки, а іноді білий по білому. Орнаменти часто містять символи води, землі та сонця, а також традиційні образи Берегині, дерева життя, рослинні мотиви. Волинські вишиванки мають багату символіку та вишуканий вигляд, відображаючи глибоку історію та культурну спадщину регіону."
    },
    {
        "name": "Закарпаття",
        "code": "Zakarpattska",
        "description": "Закарпатська вишиванка вирізняється своєю неймовірною різноманітністю, адже кожен район регіону має свої унікальні традиції вишивки. Основні види орнаментів включають бойківський (геометричні фігури), гуцульський (яскраві та різноманітні мотиви), лемківський (витончені квіткові мотиви) та угорський (виключно рослинні орнаменти). Закарпатська вишивка розвивалася від однокольорової до поліхромної, з домінуванням червоного та синього кольорів. Техніки включають низину, стебнівку, штапівку, хрестик, мережку, гладь, верхоплут і виколювання. Орнаменти варіюються від простих геометричних до складних натуралістичних композицій з квітами. Особливість закарпатських сорочок – зигзагоподібні «кривульки», різновиди ромбів та їх формотворчі елементи."
    },
    {
        "name": "Запоріжжя",
        "code": "Zaporizhzhya",
        "description": "Вишиванки Запоріжжя відзначаються впливом різних регіонів України, що відображено в різноманітності стилів та технік. Основними кольорами є червоний, який використовується як основний, та чорний, що додається як вкраплення. Характерним орнаментом є зображення квітів та калини. Запорізькі чоловічі сорочки, відомі як чумацькі, мають широкі рукави і оздоблюються вишивкою лише на комірі, виконаною лиштвою, а також вирізуванням на пазусі та рукавах. Геометричні орнаменти включають кола з розетками та ромби, часто поділені на частини та з крапками посередині, що символізують сонце."
    }
]